greeting = 'ты проснулся. старый дом. пахнет напалмом'

help = 'помощь'

around_first_room = 'Видите две двери'

seeing_first_door = 'you see door, make it purple and enter the code'
seeing_second_door = 'you see door, and number panel, and  a shkaf'

glass_room = 'you are in'

wrong_code = 'wrong code brah'
seeing_locker = 'you see locker with 5 boxes'

note_to_random_code = 'Код : 4......\nДальше не видно. всего 5 цифр, не повторяются, если не угадал сбрасывается'
garbage_found = 'some trash'

computer_room = 'you see comp'

seeing_game = 'you see mr robot game'

alarm_warning = 'Начинает орать сирена, электричество пропадает! Слышен взрыв! У вас 20 секунд покинуть здание!'
alarm_two = 'падает палка сверху'
alarm_three = 'снизу пробит пол, большая яма'
alarm_four = 'перед тобой ящик'





look_around = 'Осмотреться'
go_first_door = 'Go to the first door'
go_second_door = 'Go to the second door'
enter_code = 'enter the code'

back = 'back'
red = '🔴'
yellow = '🟡'
green = '🟢'
blue = '🔵'
black = '⚫️'
colors = [red, yellow, green, blue, black]

check_locker = 'check locker'

boxes = ['🗄1️⃣', '🗄2️⃣', '🗄3️⃣', '🗄4️⃣', '🗄5️⃣']

sit_at_comp = 'sit'

play = 'play'


default_ans = "Используй клавиатуру"

trapped = "Вы с другом заперты в подземелье.\nВы видите бочку.\nВаши действия?"
barrel = "Бочка откатывается в сторону и вы находите тайный туннель.\nВаши действия?"
friend = "Вы начинаете выбираться, но вашему другу не хватает сил.\nОн даёт вам записку.\nВаши действия?"
dark_friend = "Друг даёт вам записку.\nВаши действия?"
note = "В туннеле слишком темно.\nВаши действия?"
light_note = """В записке написано:\n"Не бросай меня здесь."\nВы оставите своего друга или останетесь?"""
beach = "Вы выползаете из туннеля и попадаетет на берег.\nВаши действия?"
boat = "Вы видите на воде судно.\nВаши действия?"
congrats = "Поздавляем, вы отправляетесь в новый мир! Хотите сыграть ещё?"
ending = "Конец. Эллиот отключает питание.\n\n<i>Связь, сотрудничесвто, идеи для квестов и дизайн -></i> @bot_deal\n\nЖелаете сыграть ещё раз?"

reset = 'you are too late you feel light and drop down'

run = 'run'
duck = 'sit'
jump = 'jump'

stumble = 'opps you go slow 2 sec'

final_speech = 'la finale'

leave = 'уйти'