greeting = 'Ты открываешь глаза. Тёмное помещение. Пахнет железом. Болит голова.'

help = 'Цель игры - покинуть странное помещение\n\n/start - чтобы начать новую игру\n\n@bot_dealla - связь'

around_first_room = 'Глаза привыкли. На полу несколько стёклышек разных цветов. Подобрал. Вижу 2 двери.'

seeing_first_door = 'Железная дверь, отливающая <b>фиолетовым</b>. Есть поле для ввода кода, а правее - линза, в которую можно вставить не больше 2 стёкол.'
seeing_second_door = 'Железная дверь с панелью, похожей на домофон'

glass_room = 'Красивая комната. Стены из толстого стекла. На улице лес. Дверей нет.'

wrong_code = 'Неверный пароль'
seeing_locker = 'Ты видишь 5 ящичков'

def generate_note(first_num):
    note_to_random_code = f"""<b>Записка</b>

<code>Код : {first_num}......</code>

Дальше стёрто, видно что было всего пять цифр, а первая - {first_num}

<code>...в случае утери кода, его можно подобрать. Нажимая на верную цифру, она загорается. Если не угадать, весь код сбрасывается, однако заново не генерируется. Цифры не повторяются</code>"""
    return note_to_random_code


garbage_found = 'Какой-то мусор...'

computer_room = 'Комната. Посередине старый компьютер.\n\n<i>Что-то из последних серий Mr Robot</i>'

seeing_game = 'Открывается игра, в которой действия вводятся текстом.'

alarm_warning = 'В конце комнаты открылась дверь.\nЭлектричество пропало! Начинает пищать серена эвакуации.\n\n<b>У вас 15 секунд покинуть здание!</b>\n\n<b>Беги!</b>'
alarm_two = 'Палка <b>сверху!</b>'
alarm_three = '<b>Cнизу</b> пробит пол!'
alarm_four = '<b>Невысокий</b> ящик!'





look_around = 'Осмотреться'
go_first_door = 'К первой двери'
go_second_door = 'Ко второй двери'
enter_code = 'Ввести код'

back = 'Назад'
red = '🔴'
yellow = '🟡'
green = '🟢'
blue = '🔵'
black = '⚫️'
colors = [black, yellow, green, blue, red]

check_locker = 'Проверить шкафчик'

boxes = ['🗄1️⃣', '🗄2️⃣', '🗄3️⃣', '🗄4️⃣', '🗄5️⃣']

sit_at_comp = 'Сесть за компьютер'

play = 'Играть'


default_ans = "Используй предложенные варианты (клавиатура)"

trapped = "Вы с другом заперты в подземелье.\nВы видите бочку.\nВаши действия?"
barrel = "Бочка откатывается в сторону и вы находите тайный туннель.\nВаши действия?"
friend = "Вы начинаете выбираться, но вашему другу не хватает сил.\nОн даёт вам записку.\nВаши действия?"
dark_friend = "Друг даёт вам записку.\nВаши действия?"
note = "В туннеле слишком темно.\nВаши действия?"
light_note = """В записке написано:\n"Не бросай меня здесь."\nВы оставите своего друга или останетесь?"""
beach = "Вы выползаете из туннеля и попадаетет на берег.\nВаши действия?"
boat = "Вы видите на воде судно.\nВаши действия?"
congrats = "Поздавляем, вы отправляетесь в новый мир! Хотите сыграть ещё?"
ending = "Конец.Вы отключаете питание."

reset = '☠️Слишком поздно!☠️\nУдар в спину. Ноги перестают держать. В глазах темнота......'

run = 'Бежать'
duck = 'Нагнуться'
jump = 'Прыгнуть'

stumble = 'Зацепился, потерял 2 секунды'

final_speech = """<b>Вы спаслись!</b>\n\n\n<i>Этот квест - дэмо-проект. Если у вас есть идеи, нужны боты, скрипты, сбор информации, ее анализ, автоматизация процессов либо желание внедрить, где это можно новые технологии, включая ИИ - @bot_dealla</i>"""

leave = 'Уйти'